---
kind: property
id: P:Autodesk.Revit.DB.Electrical.Wire.NumberOfVertices
source: html/a3396437-4d65-df7f-9400-97e5f69c0d0a.htm
---
# Autodesk.Revit.DB.Electrical.Wire.NumberOfVertices Property

The number of vertices of the wire, including the start and end point.

## Syntax (C#)
```csharp
public int NumberOfVertices { get; }
```